CFD_OF2/Section3_MeshRefine/MeshA_Refine/MeshA_R3/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        nFaces          116;
        startFace       23887;
    }
    outlet
    {
        type            patch;
        nFaces          116;
        startFace       24003;
    }
    cylinder
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          192;
        startFace       24119;
    }
    top
    {
        type            symmetryPlane;
        inGroups        List<word> 1(symmetryPlane);
        nFaces          101;
        startFace       24311;
    }
    bottom
    {
        type            symmetryPlane;
        inGroups        List<word> 1(symmetryPlane);
        nFaces          101;
        startFace       24412;
    }
    defaultFaces
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          24200;
        startFace       24513;
    }
)

// ************************************************************************* //
